In [1]:
import pandas as pd
import sqlite3 as sql

## Creating a connection to the weather.db database

In [3]:
# Telling python what database to use

conn = sql.connect('..//data//weather.db')

# Activating the cursor, which will allow us to pass queries through sqlite and access the database directly

cur = conn.cursor()

## Checking what tables exist within a database

In [4]:
# Execute tells the cursor to run the query provided

cur.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")

# fetchall() allows us to see everything returned by our query, which we store in our 'available_tables' variable

available_tables = (cur.fetchall())

In [5]:
print(available_tables)

[('Old',), ('weather2013',)]

## Querying the 'weather2013' table

In [6]:
# Let's check to see what our data looks like by selecting the first 5 rows

cur.execute("SELECT * FROM weather2013 LIMIT 5;")

weather_data_2013 = (cur.fetchall())

In [7]:
# What is the type of weather_data_2013?

type(weather_data_2013)

list

In [8]:
weather_data_2013

[('STATION',
  'NAME',
  'LATITUDE',
  'LONGITUDE',
  'ELEVATION',
  'DATE',
  'PRCP',
  'TAVG'),
 ('US1TNCH0002',
  'KINGSTON SPRINGS 0.3 ENE, TN US',
  36.0984,
  -87.0963,
  177.1,
  '1/1/13',
  0.38,
  ''),
 ('US1TNCH0002',
  'KINGSTON SPRINGS 0.3 ENE, TN US',
  36.0984,
  -87.0963,
  177.1,
  '1/2/13',
  0.08,
  ''),
 ('US1TNCH0002',
  'KINGSTON SPRINGS 0.3 ENE, TN US',
  36.0984,
  -87.0963,
  177.1,
  '1/3/13',
  0.0,
  ''),
 ('US1TNCH0002',
  'KINGSTON SPRINGS 0.3 ENE, TN US',
  36.0984,
  -87.0963,
  177.1,
  '1/4/13',
  0.0,
  '')]

## Using Pandas to place results into a DataFrame

In [9]:
# Using the same query as before to select the first 5 rows from weather2013.db

weather_2013_df = pd.read_sql_query("SELECT * FROM weather2013 LIMIT 5;", conn)

In [10]:
# Checking the type again

type(weather_2013_df)

pandas.core.frame.DataFrame

In [11]:
weather_2013_df.head()

,station,name,lat,lng,elevation,date,precip,avg_temp
0,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,PRCP,TAVG
1,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/1/13,0.38,
2,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/2/13,0.08,
3,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/3/13,0,
4,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/4/13,0,

In [12]:
# Drop the first row that has undesired column headers

weather_2013_df.drop([0,]).head()
# weather_2013_df = weather_2013_df.drop([0,])

,station,name,lat,lng,elevation,date,precip,avg_temp
1,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/1/13,0.38,
2,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/2/13,0.08,
3,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/3/13,0,
4,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/4/13,0,

In [13]:
# Whenever you drop a row, remember to reset the index!

weather_2013_df = weather_2013_df.reset_index(drop = True)

In [14]:
weather_2013_df.head()

,station,name,lat,lng,elevation,date,precip,avg_temp
0,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,PRCP,TAVG
1,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/1/13,0.38,
2,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/2/13,0.08,
3,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/3/13,0,
4,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/4/13,0,

## Example of a query using the WHERE clause

In [15]:
# This time, we'll query weather2013 to find the dates where the percipitation was greater than 1

high_perc_2013_df = pd.read_sql_query("SELECT * FROM weather2013 WHERE precip > 1;", conn)
high_perc_2013_df = high_perc_2013_df.drop([0,])
high_perc_2013_df = high_perc_2013_df.reset_index(drop = True)

In [16]:
high_perc_2013_df.head()

,station,name,lat,lng,elevation,date,precip,avg_temp
0,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/10/13,1.28,
1,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/14/13,2.93,
2,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,3/6/13,1.03,
3,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,3/11/13,1.19,
4,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,3/19/13,1.05,

## Example of a query using the BETWEEN clause

In [17]:
# This time, we'll query weather2013 to find the dates where the percipitation was between 0.2 and 0.5

mid_perc_2013_df = pd.read_sql_query("SELECT * FROM weather2013 WHERE precip BETWEEN 0.2 AND 0.5;", conn)
mid_perc_2013_df = mid_perc_2013_df.drop([0,])
mid_perc_2013_df = mid_perc_2013_df.reset_index(drop = True)

In [18]:
mid_perc_2013_df.head()

,station,name,lat,lng,elevation,date,precip,avg_temp
0,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,1/12/13,0.21,
1,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,2/13/13,0.20,
2,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,2/26/13,0.24,
3,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,3/12/13,0.37,
4,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,3/15/13,0.23,

## Same example, but using the ORDER BY to sort on percipitation

In [19]:
# Using ASC or DESC to specify how to order the desired column - Is ASC or DESC used by default?

mid_perc_2013_df = pd.read_sql_query("SELECT * FROM weather2013 WHERE precip BETWEEN 0.2 AND 0.5 ORDER BY precip;", conn)
mid_perc_2013_df = mid_perc_2013_df.drop([0,])
mid_perc_2013_df = mid_perc_2013_df.reset_index(drop = True)

In [20]:
mid_perc_2013_df.head()

,station,name,lat,lng,elevation,date,precip,avg_temp
0,US1TNCH0002,"KINGSTON SPRINGS 0.3 ENE, TN US",36.0984,-87.0963,177.1,7/19/13,0.2,
1,US1TNCH0001,"ASHLAND CITY 5.6 ENE, TN US",36.3060,-86.9660,232.9,3/24/13,0.2,
2,US1TNCH0001,"ASHLAND CITY 5.6 ENE, TN US",36.3060,-86.9660,232.9,4/1/13,0.2,
3,US1TNCH0001,"ASHLAND CITY 5.6 ENE, TN US",36.3060,-86.9660,232.9,7/4/13,0.2,
4,USC00403280,"FRANKLIN SEWAGE PLANT, TN US",35.9417,-86.8685,199.6,2/26/13,0.2,

## Best Practice - Close connections after use to prevent the tables from being locked

In [21]:
cur.close()
conn.close()